In [707]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [708]:
transactions_df = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='Transactions',header=1)
new_customer = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='NewCustomerList',header=1)
customer_demographic = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='CustomerDemographic',header=1)
customer_address = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='CustomerAddress',header=1)

### Transactions Dataset

In [709]:
print('Shape of data: ',transactions_df.shape)

Shape of data:  (20000, 13)

In [710]:
transactions_df.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [711]:
transactions_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [712]:
transactions_df.isna().sum()[transactions_df.isna().sum()>0]

online_order               360
brand                      197
product_line               197
product_class              197
product_size               197
standard_cost              197
product_first_sold_date    197
dtype: int64

In [713]:
transactions_df.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

In [714]:
#We will consider the missing values in online_order to be an offline order
transactions_df['online_order'].fillna(0,inplace=True)
transactions_df['standard_cost'].fillna(0,inplace=True)
transactions_df['product_first_sold_date'].fillna(0,inplace=True)
transactions_df.fillna('missing',inplace=True)
transactions_df.isna().sum()

transaction_id             0
product_id                 0
customer_id                0
transaction_date           0
online_order               0
order_status               0
brand                      0
product_line               0
product_class              0
product_size               0
list_price                 0
standard_cost              0
product_first_sold_date    0
dtype: int64

Check for irregularities in categorical features.

In [715]:
categorical_features = transactions_df.select_dtypes(include='object')
for column in categorical_features.columns:
    print(transactions_df[column].value_counts())

Approved     19821
Cancelled      179
Name: order_status, dtype: int64
Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
missing            197
Name: brand, dtype: int64
Standard    14176
Road         3970
Touring      1234
Mountain      423
missing       197
Name: product_line, dtype: int64
medium     13826
high        3013
low         2964
missing      197
Name: product_class, dtype: int64
medium     12990
large       3976
small       2837
missing      197
Name: product_size, dtype: int64

In [716]:
transactions_df['standard_cost'] = transactions_df['standard_cost'].astype('float')
transactions_df['product_first_sold_date'] = transactions_df['product_first_sold_date'].astype('float')

### Customer demographic

In [717]:
print('Shape of data: ',customer_demographic.shape)

Shape of data:  (4000, 13)

The data has 4000 observations and 12 features.

In [718]:
customer_demographic.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [719]:
customer_demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [720]:
customer_demographic.isna().sum()[customer_demographic.isna().sum()>0]

last_name                125
DOB                       87
job_title                506
job_industry_category    656
default                  302
tenure                    87
dtype: int64

In [721]:
customer_demographic.drop('default',axis=1,inplace=True)

In [722]:
customer_demographic['last_name'].fillna('missing',inplace=True)
customer_demographic['job_title'].fillna('missing',inplace=True)
customer_demographic['job_industry_category'].fillna('missing',inplace=True)

In [723]:
customer_demographic['DOB'].fillna(pd.to_datetime('1970-01-01'),inplace=True)
customer_demographic['tenure'].fillna(0,inplace=True)

In [724]:
customer_demographic.isna().sum()[customer_demographic.isna().sum()>0]

Series([], dtype: int64)

In [725]:
customer_demographic.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                        float64
dtype: object

Check for irregularities in categorical columns

In [726]:
cols = ['gender','job_title','job_industry_category','wealth_segment','deceased_indicator','owns_car']

for col in cols:
    print(customer_demographic[col].value_counts())

Female    2037
Male      1872
U           88
Femal        1
F            1
M            1
Name: gender, dtype: int64
missing                                 506
Business Systems Development Analyst     45
Tax Accountant                           44
Social Worker                            44
Internal Auditor                         42
                                       ...
Database Administrator I                  4
Research Assistant III                    3
Health Coach III                          3
Health Coach I                            3
Developer I                               1
Name: job_title, Length: 196, dtype: int64
Manufacturing         799
Financial Services    774
missing               656
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64
Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64
N    3998
Y       2
Name: deceased_indicator, dtype: int64
Yes    2024
No     1976
Name: owns_car, dtype: int64

In [727]:
customer_demographic.gender.replace('Female','F',inplace=True)
customer_demographic.gender.replace('Femal','F',inplace=True)
customer_demographic.gender.replace('Male','M',inplace=True)

### Customer address

In [728]:
print('Shape of data: ',customer_address.shape)

Shape of data:  (3999, 6)

In [729]:
customer_address.head(10)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9
5,7,4 Delaware Trail,2210,New South Wales,Australia,9
6,8,49 Londonderry Lane,2650,New South Wales,Australia,4
7,9,97736 7th Trail,2023,New South Wales,Australia,12
8,11,93405 Ludington Park,3044,VIC,Australia,8
9,12,44339 Golden Leaf Alley,4557,QLD,Australia,4

In [730]:
customer_address.isna().sum()[customer_address.isna().sum()>0]

Series([], dtype: int64)

In [731]:
customer_address['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [732]:
customer_address.replace('New South Wales','NSW',inplace=True)
customer_address.replace('Victoria','VIC',inplace=True)

In [733]:
customer_address.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

#### Working on training & test data

In [734]:
new_customer.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.56,0.7000,0.8750,0.743750,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.89,0.8900,1.1125,0.945625,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.01,1.0100,1.0100,1.010000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.87,1.0875,1.0875,1.087500,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.52,0.5200,0.6500,0.650000,4,4,1.703125

In [735]:
new_customer.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [736]:
new_customer.drop(['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20'],axis=1,inplace=True)
new_customer.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value'],
      dtype='object')

#### Creating target column for train data

In [737]:
customer_id_dict = dict(transactions_df['customer_id'].value_counts())

In [738]:
customer_demographic['target'] = 0
customer_demographic['number of transactions']=0
missing_customer_trans=[]

for each in customer_demographic['customer_id']:
    if each in customer_id_dict.keys():
        customer_demographic.loc[customer_demographic['customer_id']==each,'number of transactions'] = customer_id_dict[each]
    else:
        missing_customer_trans.append(customer_demographic[customer_demographic['customer_id']==each].index)

In [739]:
missing_customer_trans[0]

Int64Index([851], dtype='int64')

In [740]:
for each in missing_customer_trans:
    customer_demographic.drop(each,axis=0,inplace=True)

In [741]:
customer_demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,target,number of transactions
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,0,11
1,2,Eli,Bockman,M,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,0,3
2,3,Arlin,Dearle,M,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,0,8
3,4,Talbot,missing,M,33,1961-10-03,missing,IT,Mass Customer,N,No,7.0,0,2
4,5,Sheila-kathryn,Calton,F,56,1977-05-13,Senior Editor,missing,Affluent Customer,N,Yes,8.0,0,6

In [742]:
customer_demographic['number of transactions'].value_counts()

5     601
6     569
4     499
7     476
3     360
8     311
9     207
2     202
10    112
11     60
1      49
12     28
13     16
14      3
Name: number of transactions, dtype: int64

In [743]:
customer_demographic.loc[(customer_demographic['number of transactions']>=0) & (customer_demographic['number of transactions']<=6),'target'] = 0
customer_demographic.loc[(customer_demographic['number of transactions']>=7) & (customer_demographic['number of transactions']<=14),'target'] = 1
# customer_demographic.loc[(customer_demographic['number of transactions']>=10) & (customer_demographic['number of transactions']<=14),'target'] = 2

In [744]:
customer_demographic.drop('number of transactions',axis=1,inplace=True)
customer_demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,target
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,1
1,2,Eli,Bockman,M,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,0
2,3,Arlin,Dearle,M,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,1
3,4,Talbot,missing,M,33,1961-10-03,missing,IT,Mass Customer,N,No,7.0,0
4,5,Sheila-kathryn,Calton,F,56,1977-05-13,Senior Editor,missing,Affluent Customer,N,Yes,8.0,0

In [745]:
train = customer_demographic.merge(customer_address,on='customer_id')
train

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,target,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,Eli,Bockman,M,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,0,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,Talbot,missing,M,33,1961-10-03,missing,IT,Mass Customer,N,No,7.0,0,0 Holy Cross Court,4211,QLD,Australia,9
3,5,Sheila-kathryn,Calton,F,56,1977-05-13,Senior Editor,missing,Affluent Customer,N,Yes,8.0,0,17979 Del Mar Point,2448,NSW,Australia,4
4,6,Curr,Duckhouse,M,35,1966-09-16,missing,Retail,High Net Worth,N,Yes,13.0,0,9 Oakridge Court,3216,VIC,Australia,9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3484,3496,Danya,Burnyeat,M,99,1986-04-25,Editor,Manufacturing,Mass Customer,N,Yes,19.0,0,2565 Caliangt Point,2171,NSW,Australia,9
3485,3497,Thia,O'Day,F,73,1986-05-03,Administrative Assistant IV,Manufacturing,Affluent Customer,N,Yes,18.0,0,96 Delladonna Trail,3976,VIC,Australia,5
3486,3498,Lois,Abrahim,F,28,1995-11-02,missing,Manufacturing,Mass Customer,N,No,5.0,0,3 Nova Point,3012,VIC,Australia,4
3487,3499,Shelton,Tewkesberrie,M,29,1979-06-17,missing,Manufacturing,Mass Customer,N,Yes,7.0,1,310 Stephen Terrace,4073,QLD,Australia,9
3488,3500,Josy,Fleeman,F,71,1967-07-21,missing,Entertainment,Affluent Customer,N,No,17.0,0,9491 Green Ridge Terrace,2100,NSW,Australia,10

In [746]:
new_customer.DOB.fillna(pd.to_datetime('1970-01-01'),inplace=True)
new_customer.fillna('missing',inplace=True)
new_customer.isna().sum()[new_customer.isna().sum() > 0]

Series([], dtype: int64)

In [747]:
train.drop('customer_id',axis=1,inplace=True)
new_customer.drop(['Rank','Value'],axis=1,inplace=True)

In [748]:
train.shape

(3489, 17)

In [749]:
new_customer.shape

(1000, 16)

In [750]:
train.to_csv('train.csv',index=False)
new_customer.to_csv('test.csv',index=False)